Revit 2026 API

# DimensionResetTextPosition Method

---

Resets the text position of the dimension to the initial position determined by its type and parameters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetTextPosition()
```
```vb
Public Sub ResetTextPosition
```
```cpp
public:
void ResetTextPosition()
```
```fsharp
member ResetTextPosition : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when: |

  * SpotDimension has more than one segments.

The initial point is the text position determined by the type and parameters of the dimension. This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding method of the DimensionSegment class.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace